SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-65030-B

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( J21.s )
 Size ( 2.86085m 4.0753m 8.203876m  )
Mass ( 49.5t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 5cm 0cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 116kN ) Comment(Brake % 55 WWO CoF 0.5)
MaxHandbrakeForce ( 0kN ) Comment(ctn calc)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.5m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 16.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 4359 )
ORTSDavis_B ( 14.18 )
ORTSDavis_C ( 5.075 )

ORTSWagonFrontalArea (95ft^2)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 2
			Light	(
			comment( Front White Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 0 3.2 3.1 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.70 )
					)
				)
			)
			Light	(
			comment( Front Red Lamp Position B-Reversed )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 4 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( ccff0000 )
					Position ( 0 3.2 3.1 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.70 )
					)
				)
			)
		)

Comment( ******* Miscellaneous Wagon Information************ )

FreightAnim ( crew_33.s 1 1 )

Comment (Passenger View)	
	Inside (
	WagonShape ( J21.s )
        PassengerCabinHeadPos ( 1.423 3.0 -2.6 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)



Engine ( OR-65030-B

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0 3.3 -2.3
				0 1 0
				0.15
			)
			SafetyValvesFX
			(
				0 3.2 -1.75
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.14 2.32
				0 1 0
				0.3
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-1 -1 -1
				0.05
			)

			Injectors2FX
			(
				-1. 0.85 -3.4
				0 -1 0
				0.15
			)
			Injectors1FX
			(
				1 0.85 -3.4
				0 -1 0
				0.15
			)

			CylindersFX
			(
				-0.5 0.7 2.77
				0 0 1
				0.18
			)

			CylindersFX
			(
				0.5 0.7 2.77
				0 0 1
				0.18
			)
		)
	)

Wagon ( OR-65030-B )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 30.625in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 42.4t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 113ft^3 ) 
ORTSEvaporationArea ( 858.1ft^2 )
ORTSSuperheatArea ( 183.5ft^2 )
MaxBoilerPressure ( 160psi )
MaxSteamHeatingPressure ( 40psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 24in ) 
CylinderDiameter ( 19in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 17.2ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 3.5t-uk )
MaxTenderWaterMass ( 35000lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

Comment(ORTSMaxIndicatedHorsepower ( 931.0hp )) 

Comment(ORTSMaxSuperheatTemperature ( 128.0 ))

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 ) Comment(From 4MT Report)

ORTSBurnRate( 0.0 10.0  7875.0 1000.0  12337.0 2000.0  14875.0 2500.0  16275.0 3000.0  18375.0 3500.0 ) Comment(From Pawson Graph)

Comment(ORTSBurnRate( 0.0 10.0   6000.0 690.0   8000.0 965.0   10000.0 1260.0   12000.0 1580.0   14000.0 1935.0   16000.0 2335.0  18000.0 2790.0  19600.0 3250.0  22490.0 5078.0 )) Comment (From 4-6-0 4MT Report)

    
Comment ( *******************Brake System ******************** )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21 )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )
            
Brake_Hand ( 0 1 0.0125 0
	NumNotches ( 0 ))
FireDoor ( 4 4 0.4 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
Comment(WaterScoop ( 0 1 0 ))
SmallEjectorOrCompressor( 0 1 1 )
BellToggle( 0 1 0 )
Headlights( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( B1.cvf )
HeadOut (  -1.423 3.0 -2.6 )
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
Name ( "65030 J21 TW Worsdell, Local Passenger, TE: 24.64Klbf, Coal 3.5t, Water 3500gal" )
Description (
"The North Eastern Railway (NER) Class C1, was a class of 0-6-0 freight locomotives designed by T.W. Worsdell. They were used throughout the NER system, although particularly in Teesside between 1886 and 1962.
All 201 of the class passed into the London and North Eastern Railway ownership in 1923, and they were classified J21 but without any sub-classes to reflect the different backgrounds or dimensions.
The mechanical history of the class is very complex, and both Wilson Worsdell and Vincent Raven made changes to the class. All the Class C compounds were rebuilt as Class C1 simple. Many examples were later rebuilt with a superheater and others had the original Joy valve gear replaced with piston valves and Stephenson valve gear. Some locos were further rebuilt with superheaters, 19 inch bore cylinders, piston valves and Stephenson valve gear. The superheaters were later removed from some of these locomotives.")
)